app/views/histories/index.html.erb

        <td><%= value.price %></td>
        <td><%= @companies.find(value.idCompany).name %></td>
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]