app/views/departures/index.html.erb

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td><%= departure.price %></td>
        <td><%= @companies.find(departure.idCompany).name %></td>