app/views/departures/show.html.erb

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <div class="row">
      <label>Company:</label><h2><%= @companies.find(@departure.idCompany).name %></h2>