app/controllers/departures_controller.rb

  def index
    @time = DateTime.now
    @departures = Departure.paginate(:page => params[:page], :per_page => 10).where("numberOfTickets > 0").where("departureDate >= ?",DateTime.now.in_time_zone("Berlin"))
---
SELECT  "departures".* FROM "departures" WHERE (numberOfTickets > 0) AND (departureDate >= '2018-06-15 14:35:28.453327') LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "departures" WHERE (numberOfTickets > 0) AND (departureDate - '2018-06-15 14:37:47.897617') >= 1)

  def create
      @departure = Departure.new(departure_params)
      if(@departure.departureDate >= @departure.arrival or @departure.numberOfTickets <= 0 or @departure.price <= 0)
        render "error",:locals => {:errorType =>  "c"}
        return
      end
      if @departure.save
---
INSERT INTO "departures" ("from", "to", "departureDate", "arrival", "numberOfTickets", "idCompany", "created_at", "updated_at", "price") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    if user_signed_in?
      @card = Card.new
      @departure = Departure.find(params[:id])
      @company = Company.find(@departure.idCompany)
---
SELECT  "departures".* FROM "departures" WHERE "departures"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "departures".* FROM "departures" WHERE "departures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def buy
    if user_signed_in?
      @departure = Departure.find(params[:format])
      if @departure.numberOfTickets > 0
        @card = Card.new(card_params)
        numberOfTickets = @departure.numberOfTickets
        numberOfTickets -=1
        atributes = {"idUser" => current_user.id,"idDeparture" => @departure.id}
        @history = History.new(atributes)
        if @departure.update(numberOfTickets:numberOfTickets) and @history.save and @card.save
---
SELECT  "departures".* FROM "departures" WHERE "departures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "cards" ("idUser", "cardNumber", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["idUser", 1], ["cardNumber", "1"], ["created_at", "2018-06-15 15:27:54.563353"], ["updated_at", "2018-06-15 15:27:54.563353"]]
INSERT INTO "histories" ("idUser", "idDeparture", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["idUser", 1], ["idDeparture", 2], ["created_at", "2018-06-15 15:27:54.474801"], ["updated_at", "2018-06-15 15:27:54.474801"]]
UPDATE "departures" SET "numberOfTickets" = ?, "updated_at" = ? WHERE "departures"."id" = ?  [["numberOfTickets", 29], ["updated_at", "2018-06-15 15:27:54.412002"], ["id", 2]]

  def destroy
    if( @histories = History.where(idDeparture: params[:id])).count > 0
      render "error",:locals => {:errorType =>  "d"}
      return
    end
    @departure.destroy
---
SELECT COUNT(*) FROM "histories" WHERE "histories"."idDeparture" = ?  [["idDeparture", 4]]
DELETE FROM "departures" WHERE "departures"."id" = ?  [["id", 4]]

  def update
    if( @histories = History.where(idDeparture: params[:id])).count > 0
      render "error",:locals => {:errorType =>  "b"}
      return
    end
    if @departure.update(departure_params)
---
SELECT COUNT(*) FROM "histories" WHERE "histories"."idDeparture" = ?  [["idDeparture", 2]]
UPDATE "departures" SET "arrival" = ?, "updated_at" = ? WHERE "departures"."id" = ?  [["arrival", "2019-06-20 19:00:00"], ["updated_at", "2018-06-15 16:25:10.626543"], ["id", 1]]

    def find_departure
      @departure = Departure.find(params[:id])
---
SELECT  "departures".* FROM "departures" WHERE "departures"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]