app/controllers/departures_controller.rb

SELECT "departures".* FROM "departures"
---
  def index
    @departures = Departure.all

INSERT INTO "histories" ("idUser", "idDeparture", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["idUser", 1], ["idDeparture", 1], ["created_at", "2018-06-14 22:10:11.453592"], ["updated_at", "2018-06-14 22:10:11.453592"]]
UPDATE "departures" SET "numberOfTickets" = ?, "updated_at" = ? WHERE "departures"."id" = ?  [["numberOfTickets", 0], ["updated_at", "2018-06-14 22:10:11.537335"], ["id", 1]]
---
  def buy
    @departure = Departure.find(params[:format])
    if @departure.numberOfTickets > 0
      numberOfTickets = @departure.numberOfTickets
      numberOfTickets -=1
      @history = History.create(idUser:current_user.id,idDeparture:@departure.id)
      if @departure.update(numberOfTickets:numberOfTickets) and @history.save

SELECT  "departures".* FROM "departures" WHERE "departures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_departure
      @departure = Departure.find(params[:id])