app/controllers/histories_controller.rb

  def index
    if user_signed_in?
      @histories = History.where(idUser: current_user.id).order("")
      @departuresId = {}
      @histories.each  do  |x|
        @departuresId[x.id] = x.idDeparture
      end
      @departures = {}
      @departuresId.each do |key,value|
        @departures[key] = Departure.find(value)
---
SELECT "histories".* FROM "histories" WHERE "histories"."idUser" = ?  [["idUser", 1]]
SELECT  "departures".* FROM "departures" WHERE "departures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @departure = Departure.find(@history.idDeparture)
    numberOfTickets = @departure.numberOfTickets
    numberOfTickets +=1
    @departure.update(numberOfTickets:numberOfTickets)
    @history.destroy
---
SELECT  "departures".* FROM "departures" WHERE "departures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "departures" SET "numberOfTickets" = ?, "updated_at" = ? WHERE "departures"."id" = ?  [["numberOfTickets", 100], ["updated_at", "2018-06-15 14:21:21.494608"], ["id", 1]]
DELETE FROM "histories" WHERE "histories"."id" = ?  [["id", 19]]

    def find_entry
      @history = History.find(params[:id])
---
SELECT  "histories".* FROM "histories" WHERE "histories"."id" = ? LIMIT ?  [["id", 42], ["LIMIT", 1]]